// search index for WYSIWYG Web Builder
var database_length = 0;

function SearchPage(url, title, keywords, description)
{
   this.url = url;
   this.title = title;
   this.keywords = keywords;
   this.description = description;
   return this;
}

function SearchDatabase()
{
   database_length = 0;
   this[database_length++] = new SearchPage("index.html", "Україна і світ. 5 клас", "Розділ 2 Особистість в історії   ", "");
   this[database_length++] = new SearchPage("p1.html", "Україна і світ. 5 клас", "Розділ 2 ОСОБИСТІСТЬ В ІСТОРІЇ § 9 Кого називають історичною особистістю?  ІНТЕРАКТИВНІ ВПРАВИ  НАЙВАЖЛИВІШЕ    ", "");
   this[database_length++] = new SearchPage("p1p1.html", "Україна і світ. 5 клас", "Прочитай уривок із листа української художниці Катерини Білокур   «Пряла, шила, ткала і взагалі виконувала всяку сільськогосподарську роботу Малювати мені забороняли а в думці було, що прийде той час    і буду малювати    а буду художником і все...» Доповни висновок історика словами з довідки Виконай інтерактивну вправу  Білокур Катерина Василівна   ", "");
   this[database_length++] = new SearchPage("p2.html", "Україна і світ. 5 клас", "§ 10 Як улаштоване суспільство?  ІНТЕРАКТИВНІ ВПРАВИ  НАЙВАЖЛИВІШЕ    ", "");
   this[database_length++] = new SearchPage("p2p2.html", "Україна і світ. 5 клас", "Велика хартія вольностей  У 1215 році в Англії король Іоанн затвердив Велику хартію вольностей Документ обмежував владу короля та захищав права вільних людей Одне з його положень забороняло ув’язнювати вільну людину інакше як за законним рішенням та відповідно до закону  Велика хартія вольностей   ", "");
   this[database_length++] = new SearchPage("p3.html", "Україна і світ. 5 клас", "§ 11 Як людина впливає на розвиток держави?  ІНТЕРАКТИВНІ ВПРАВИ  НАЙВАЖЛИВІШЕ    ", "");
   this[database_length++] = new SearchPage("p3p3.html", "Україна і світ. 5 клас", "У 1955 році в американському місті Монтгомері Роза Паркс відмовилася поступитися місцем в автобусі білому пасажирові За це її заарештували На знак протесту тисячі жителів міста понад рік не користувалися міськими автобусами Ця подія стала важливою частиною боротьби за рівні права у США  Автобус у якому їхала Роза Паркс Музей Генрі Форда  Роза Паркс   ", "");
   this[database_length++] = new SearchPage("pro.html", "Україна і світ. 5 клас", "                                                           Про інтерактивний електронний додаток  Цей е-додаток створено для того, щоб урізноманітнити навчання за підручником, зробити його ефективнішим і цікавішим Контент подано за розділами та параграфами відповідно до змісту підручника   Тут ви можете   ознайомитися з текстом підручника  стисло зрозуміти матеріал уроку за допомогою інфографіки параграфа  переглянути навчальні відео, отримати додаткову цікаву інформацію  перевірити свої знання за допомогою інтерактивних вправ  Системні вимоги Операційна система — Windows 7 чи пізніші версії, Linux, ChromeOS, macOS, Android, iOS Оперативна пам’ять — 4 ГБ і більше Web browser — усі, що підтримують HTML5 Місце на жорсткому диску  для роботи офлайн  — 2 ГБ і більше  Uicons Flaticon   ", "");
   this[database_length++] = new SearchPage("p4.html", "Україна і світ. 5 клас", "§ 12 Як людина впливає на довкілля?  ІНТЕРАКТИВНІ ВПРАВИ  НАЙВАЖЛИВІШЕ    ", "");
   this[database_length++] = new SearchPage("p4p4.html", "Україна і світ. 5 клас", "У XVII–XIX століттях зими в Європі іноді були значно холоднішими, ніж сьогодні У Лондоні річка Темза кілька разів замерзала настільки сильно, що її крига ставала новим простором міського життя На замерзлій річці люди встановлювали ятки, продавали їжу, влаштовували ігри та розваги Такі події отримали назву «морозні ярмарки»  Темза  Ярмарок на річці   ", "");
   this[database_length++] = new SearchPage("p5.html", "Україна і світ. 5 клас", "§ 13 Як культура і наука змінюють світ?  ІНТЕРАКТИВНІ ВПРАВИ  НАЙВАЖЛИВІШЕ    ", "");
   this[database_length++] = new SearchPage("p6.html", "Україна і світ. 5 клас", "§ 14 Рефлексія теми Проєктна діяльність  ІНТЕРАКТИВНІ ВПРАВИ  УЗАГАЛЬНЕННЯ   ", "");
   this[database_length++] = new SearchPage("p6p6.html", "Україна і світ. 5 клас", "У 79 році виверження Везувію поховало під вулканічними матеріалами давньоримські Помпеї Завдяки цьому збереглися будинки, вулиці, написи та численні предмети повсякденного життя  Один день, що зберіг історію  Уяви, що перед тобою знахідки з Помпеїв Що вони можуть розповісти про життя людей? Виконай вправу, поєднай знахідку з тим, про що вона розповідає   ", "");
   return this;
}
